Repository: GamemakerChina/GmlSpec-CN
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: This function can be used to checks if the given sound index can be played currently.
zh_cn: 此函数可用于检查当前是否可以播放给定的声音索引。

source: This function can be used to clear a given DS grid to a specific value.
zh_cn: 此函数可用于将给定的DS网格清除到特定值。

source: This function can be used to clear a specific "cell" of an MP grid.
zh_cn: 此函数可用于清除MP网格的特定"单元"。

source: This function can be used to clear the entire screen (with no alpha blend) to the given colour, and is only for use in the draw event of an instance (it will not show if used in any other event).
zh_cn: 此函数可以用来清除整个屏幕(没有alpha混合)到给定的颜色，并且只在实例的绘制事件中使用(如果在任何其他事件中使用它将不会显示)。

source: This function can be used to clear the entire screen with a given colour and the alpha component of the destination is set to the value you have set - this function does not do any blending as it works but any subsequent blend operations can be set up to use the destination alpha that you have set.
zh_cn: 此函数可以用来用给定的颜色清除整个屏幕，目标的alpha组件被设置为你所设置的值-此函数在工作时不做任何混合，但任何后续的混合操作都可以设置为使用你所设置的目标alpha。

source: This function can be used to convert a string which has been created previously by the function ds_grid_write() back into a DS grid.
zh_cn: 此函数可用于将先前由函数ds_grid_write()创建的字符串转换回DS网格。

source: This function can be used to convert the given ds_grid into a string, which can then be stored in an external file (for example).
zh_cn: 此函数可以用来将给定的ds_grid转换成一个字符串，然后可以存储在一个外部文件中(例如)。

source: This function can be used to copy a segment (or all) of the data stored in one buffer to another.
zh_cn: 此函数可用于将一个缓冲区中存储的一段(或全部)数据复制到另一个缓冲区中。

source: This function can be used to copy some (or all) of the vertex data stored in one vertex buffer into a previously created regular buffer.
zh_cn: 此函数可用于将存储在一个顶点缓冲区中的一些(或全部)顶点数据复制到先前创建的常规缓冲区中。

source: This function can be used to copy the contents of a rectangular area of grid cells from one (previously defined) DS grid to another, or it can be used to copy a region from within the same grid.
zh_cn: 此函数可用于将网格单元的矩形区域的内容从一个(先前定义的)DS网格复制到另一个，或者可用于从同一网格内复制一个区域。

source: This function can be used to copy the contents of one priority queue into another.
zh_cn: 此函数可用于将一个优先级队列的内容复制到另一个优先级队列中。

source: This function can be used to copy the contents of one queue into another.
zh_cn: 此函数可以用来将一个队列的内容复制到另一个队列中。

source: This function can be used to copy the contents of one stack into another.
zh_cn: 此函数可用于将一个堆栈的内容复制到另一个堆栈中。

source: This function can be used to create a custom analytic to track something outside of the scope of the provider being used, and will also accept custom parameter/value pairs, where the parameter is a string and the value a real number.
zh_cn: 此函数可用于创建自定义分析，以跟踪所使用的提供者范围之外的内容，并且还将接受自定义参数/值对，其中参数为字符串，值为实数。

source: This function can be used to create a custom analytic to track something outside of the scope of the provider being used.
zh_cn: 此函数可用于创建自定义分析，以跟踪所使用的提供者范围之外的内容。

source: This function can be used to create a new animation curve channel struct.
zh_cn: 此函数可用于创建新的动画曲线通道结构。

source: This function can be used to create a new points struct to be added to an animation curve channel.
zh_cn: 此函数可以用来创建一个新的点结构，并添加到一个动画曲线通道中。

source: This function can be used to create your own custom matrix and will return an index value for this new matrix which should be stored in a variable for future reference and use.
zh_cn: 此函数可用于创建您自己的自定义矩阵，并将返回该新矩阵的索引值，该值应存储在变量中以供将来参考和使用。

source: This function can be used to define an external function call to a specific dll (for Windows) or dylib (for Mac).
zh_cn: 此函数可用于定义对特定dll (Windows)或dylib (Mac)的外部函数调用。

source: This function can be used to destroy all the instances assigned to the given layer.
zh_cn: 此函数可以用来销毁分配给给定层的所有实例。

source: This function can be used to destroy any animation curves that have been previously created with the function animcurve_create().
zh_cn: 此函数可以用来销毁之前用animcurve_create()函数创建的任何动画曲线。

source: This function can be used to detect the current threshold setting of the analogue buttons for a given device.
zh_cn: 此函数可用于检测给定设备模拟按钮的当前阈值设置。

source: This function can be used to display debug information about the audio system, with true switching it on and false to switch it off.
zh_cn: 此函数可以用来显示音频系统的调试信息，true表示打开，false表示关闭。

source: This function can be used to draw a given tilemap anywhere in the room.
zh_cn: 此函数可以用来在房间的任何地方绘制给定的tilemap。

source: This function can be used to enable or disable anti-aliasing (AA) for fonts added using font_add().
zh_cn: 此函数可用于启用或禁用使用font_add()添加的字体的抗锯齿(AA)。

source: This function can be used to enable or disable fog drawing.
zh_cn: 此函数可用于启用或禁用拉雾。

source: This function can be used to enable or disable texture debug messages.
zh_cn: 此函数可以用来启用或禁用纹理调试消息。

source: This function can be used to fill a previously created buffer with a given data type and value.
zh_cn: 此函数可用于用给定的数据类型和值填充先前创建的缓冲区。

source: This function can be used to find out if the background element is tiled horizontally or not.
zh_cn: 此函数可以用来确定背景元素是否水平平铺。

source: This function can be used to find out if the background element is tiled vertically or not.
zh_cn: 此函数可以用来确定背景元素是否垂直平铺。

source: This function can be used to find out whether the given path is smooth (true) or not (false).
zh_cn: 此函数可以用来找出给定的路径是光滑的(true)还是不光滑的(false)。

source: This function can be used to find the last character (as an UTF8 value) that was used when your font asset was added to your game.
zh_cn: 此函数可以用来找到最后一个字符(作为一个UTF8值)，当你的字体资源被添加到你的游戏。

source: This function can be used to find the maximum value for all the cells found within the defined disk area of a grid, as shown in the image below:
zh_cn: 此函数可以用来找到网格中定义的圆盘区域内所有单元格的最大值，如下图所示:

source: This function can be used to find the maximum value for all the cells found within the defined region of a grid, as shown in the image below:
zh_cn: 此函数可以用来找到网格中定义区域内所有单元格的最大值，如下图所示:

source: This function can be used to find the mean value for all the cells found within the defined disk area of a grid (all cell values are added together and then divided by the total number of cells that make up the disk), as shown in the image below:
zh_cn: 此函数可以用来找到网格中定义的圆盘区域内所有单元格的平均值(所有的单元格值相加，然后除以组成圆盘的单元格总数)，如下图所示:

source: This function can be used to find the mean value for all the cells found within the defined region of a grid (all cell values are added together and then divided by the total number of cells that make the region), as shown in the image below:
zh_cn: 此函数可以用来找到网格中定义区域内所有单元格的平均值(所有单元格的值相加，然后除以构成该区域的单元格总数)，如下图所示:

source: This function can be used to find the minimum value for all the cells found within the defined disk area of a grid, as shown in the image below:
zh_cn: 此函数可以用来寻找网格中定义的圆盘区域内所有单元格的最小值，如下图所示:

source: This function can be used to find the minimum value for all the cells found within the defined region of a grid, as shown in the image below:
zh_cn: 此函数可以用来寻找网格中定义区域内所有单元格的最小值，如下图所示:

source: This function can be used to flag a given path as being open (false) or closed (true).
zh_cn: 此函数可以用来标记一个给定的路径是开放的(假)还是封闭的(真)。

source: This function can be used to get information on the named bone at any time and store the data in an empty DS map, which you must have created previously.
zh_cn: 此函数可用于随时获取命名骨骼的信息，并将数据存储在一个空的DS贴图中，该贴图必须是您之前创建的。

source: This function can be used to get or to set the position of an instance along a path.
zh_cn: 此函数可用于获取或设置实例在路径上的位置。

source: This function can be used to get the "dead zone" value of the joystick axis.
zh_cn: 此函数可以用来获取操纵杆轴的"死区"值。

source: This function can be used to get the alpha value of the background element.
zh_cn: 此函数可以用来获取背景元素的透明度(Alpha)值。

source: This function can be used to get the alpha value of the sprite element.
zh_cn: 此函数可用于获取精灵元素的透明度(Alpha)值。

source: This function can be used to get the anti-aliasing (AA) level for SWF format vector sprites.
zh_cn: 此函数可用于获取 SWF 格式矢量精灵的抗锯齿 (AA) 级别。

source: This function can be used to get the blend colour of the background element.
zh_cn: 此函数可以用来获取背景元素的混合颜色。

source: This function can be used to get the blend colour of the sprite element.
zh_cn: 此函数可以用来获取精灵元素的混合颜色。

source: This function can be used to get the colour of a specific pixel from a surface, using the local coordinates of the surface where (0,0) is the top left corner.
zh_cn: 此函数可用于从表面获取特定像素的颜色，使用表面的局部坐标，其中(0,0)为左上角。

source: This function can be used to get the cross-origin type set for HTML5 games and will return a string (on all other platforms an empty string "" will be returned).
zh_cn: 此函数可用于获得HTML5游戏的跨源类型设置，并将返回一个字符串(在所有其他平台上将返回空字符串"")。

source: This function can be used to get the current angle for the sprite element.
zh_cn: 此函数可用于获取精灵元素的当前角度。

source: This function can be used to get the current image index value of the background element.
zh_cn: 此函数可以用来获取背景元素的当前图像索引值。

source: This function can be used to get the current image index value of the sprite element.
zh_cn: 此函数可以用来获取精灵元素的当前图像索引值。

source: This function can be used to get the current scale multiplier along the x axis for the sprite element.
zh_cn: 此函数可用于获取sprite元素沿x轴的当前缩放倍数。

source: This function can be used to get the current scale multiplier along the y axis for the sprite element.
zh_cn: 此函数可用于获取sprite元素沿 y 轴的当前缩放倍数。

source: This function can be used to get the current scale multiplier value of the background element.
zh_cn: 此函数可以用来获取背景元素的当前缩放乘数值。

source: This function can be used to get the current sleep margin value used for the render timing of your game, and will return a millisecond value.
zh_cn: 此函数可以用来获取游戏渲染时间的当前睡眠余量值，并将返回一个毫秒值。

source: This function can be used to get the current speed multiplier value of the background element.
zh_cn: 此函数可用于获取背景元素的当前速度乘数值。

source: This function can be used to get the current speed multiplier value of the sprite element.
zh_cn: 此函数可以用来获取sprite元素的当前速度乘数值。

source: This function can be used to get the current sprite index of the sprite element.
zh_cn: 此函数可以用来获取sprite元素的当前sprite索引。

source: This function can be used to get the current sprite index value of the background element.
zh_cn: 此函数可以用来获取背景元素的当前精灵索引值。

source: This function can be used to get the current value of the given alarm.
zh_cn: 此函数可用于获取给定告警的当前值。

source: This function can be used to get the game speed as either the number of game frames to run per second or as the number of micro seconds per game frame.
zh_cn: 此函数可用于获取游戏速度，即每秒运行的游戏帧数或每帧运行的游戏微秒数。

source: This function can be used to get the get pitch of a given sound.
zh_cn: 此函数可以用来获取给定声音的音高。

source: This function can be used to get the name (as a string) that was given to the font when it was added as an asset to the GameMaker Asset Browser.
zh_cn: 此函数可以用来获取名称(作为字符串)，当字体作为资源添加到GameMaker资源浏览器时，它被赋予的名称。

source: This function can be used to get the name of a time line as a string.
zh_cn: 此函数可以用来以字符串的形式获取时间线的名称。

source: This function can be used to get the name of the function that was used to create a struct when the struct was created using a constructor function and the new operator.
zh_cn: 此函数可用于获取在使用构造函数和new操作符创建结构时用于创建结构的函数的名称。

source: This function can be used to get the status of the virtual keyboard on the device running the game.
zh_cn: 此函数可用于获取运行游戏的设备上虚拟键盘的状态。

source: This function can be used to get the stretched state of the background element sprite.
zh_cn: 此函数可以用来获取背景元素精灵的拉伸状态。

source: This function can be used to get the tile index (the position of the tile within the tile set image) from a set of tile-data.
zh_cn: 此函数可用于从一组图块数据中获取图块索引(图块在图块集图像中的位置)。

source: This function can be used to get the unique ID value for a given layer.
zh_cn: 此函数可以用来获取给定层的唯一ID值。

source: This function can be used to get the unique instance ID of the given instance element.
zh_cn: 此函数可用于获取给定实例元素的唯一实例ID。

source: This function can be used to get the value (either a real number or a string) from any cell within the given DS grid.
zh_cn: 此函数可用于从给定DS网格中的任何单元格中获取值(实数或字符串)。

source: This function can be used to get the value at a specific point in time from a channel struct.
zh_cn: 此函数可用于从通道结构获取特定时间点的值。

source: This function can be used to get the visible state of the background element.
zh_cn: 此函数可以用来获取背景元素的可见状态。

source: This function can be used to get the x position of the sprite element in the room.
zh_cn: 此函数可以用来获取sprite元素在房间中的x位置。

source: This function can be used to get the y position of the sprite element in the room.
zh_cn: 此函数可以用来获取sprite元素在房间中的y位置。

source: This function can be used to give an emitter Doppler effects and simulate audio motion based on the vector that is resolved from the given relative x, y and z positions.
zh_cn: 此函数可用于给出发射器多普勒效应，并基于从给定的相对x、y和z位置解析的矢量模拟音频运动。

source: This function can be used to give the given listener Doppler effects and simulate audio motion based on the vector that is resolved from the given relative x, y and z positions.
zh_cn: 此函数可用于给出给定的听者多普勒效应，并基于从给定的相对x、y和z位置解析的矢量模拟音频运动。

source: This function can be used to give the listener Doppler effects and simulate audio motion based on the vector that is resolved from the given relative x, y and z positions.
zh_cn: 此函数可用于给出听者多普勒效应，并基于从给定的相对x、y和z位置解析的矢量模拟音频运动。

source: This function can be used to hide the virtual keyboard on the device running the game.
zh_cn: 此函数可用于隐藏运行游戏的设备上的虚拟键盘。

source: This function can be used to indicate to GameMaker whether textures should repeat (true) or not (false) when used for models and primitives.
zh_cn: 此函数可以用来向GameMaker指示纹理在用于模型和图元时是应该重复(true)还是不重复(false)。

source: This function can be used to make your particle burst another type of particle at the end of its lifetime.
zh_cn: 此函数可用于使您的粒子在其寿命结束时爆发另一种类型的粒子。

source: This function can be used to make your particle type stream another type each step until the end of its lifetime.
zh_cn: 此函数可用于将粒子类型流的每一步设置为另一种类型，直到其生命周期结束。

source: This function can be used to move a given instance from the layer it is currently on to another layer.
zh_cn: 此函数可用于将给定实例从其当前所在的层移动到另一层。

source: This function can be used to move through a buffer, finding the start, the end, or a position relative to that which was last used when reading or writing data.
zh_cn: 此函数可用于在缓冲区中移动，查找开始、结束或相对于读取或写入数据时最后一次使用的位置。

source: This function can be used to parse a JSON string (either previously created using json_stringify or from any valid source), and convert it into a collection of arrays or structs, where an array is the equivalent of a JSON array and a struct is the equivalent of a JSON object.
zh_cn: 此函数可用于解析JSON字符串(可以是以前使用json_stringify创建的，也可以是从任何有效的源创建的)，并将其转换为数组或结构的集合，其中数组相当于JSON数组，结构相当于JSON对象。

source: This function can be used to prefetch (place into texture memory) a number of texture pages that contain the sprites given.
zh_cn: 此函数可以用来预取(放入纹理存储器)一些包含给定精灵的纹理页面。

source: This function can be used to prefetch (place into texture memory) a texture page with the given sprite.
zh_cn: 此函数可以用来预取一个给定精灵的纹理页面。

source: This function can be used to randomise the positions of all values in all cells within a grid.
zh_cn: 此函数可用于随机化网格内所有单元格中所有值的位置。

source: This function can be used to re-scale the given path along both (or either) the vertical and horizontal axis, basically moving each of the path points to a new position corresponding to this scale around the centre of the path.
zh_cn: 此函数可以用于沿着垂直和水平轴重新缩放给定的路径，基本上是将每个路径点移动到一个新的位置，对应于围绕路径中心的这个缩放。

source: This function can be used to read data from a previously created buffer.
zh_cn: 此函数可用于从先前创建的缓冲区中读取数据。

source: This function can be used to remove a previously created vertex buffer (see vertex_create_buffer()) from system memory.
zh_cn: 此函数可用于从系统内存中删除先前创建的顶点缓冲区(参见vertex_create_buffer())。

source: This function can be used to remove the current device mapping from the given gamepad slot index.
zh_cn: 此函数可用于从给定的游戏手柄插槽索引中移除当前设备映射。

source: This function can be used to resize a tile map element.
zh_cn: 此函数可用于调整tile map元素的大小。

source: This function can be used to retrieve the ID of the script function assigned as the update script for the given camera.
zh_cn: 此函数可用于检索指定为给定相机的更新脚本的脚本函数的ID。

source: This function can be used to retrieve the ID of the script function assigned as the begin script for the given camera.
zh_cn: 此函数可用于检索脚本函数的ID，此函数被指定为给定相机的开始脚本。

source: This function can be used to retrieve the ID of the script function assigned as the end function for the given camera.
zh_cn: 此函数可用于检索脚本函数的ID，该脚本函数被指定为给定相机的结束函数。

source: This function can be used to retrieve the Z depth set for rendering layers within the room.
zh_cn: 此函数可用于检索渲染房间内层的Z深度集。

source: This function can be used to retrieve the alpha-blending state.
zh_cn: 此函数可用于检索alpha混合状态。

source: This function can be used to retrieve the angle of the given camera.
zh_cn: 此函数可用于检索给定相机的角度。

source: This function can be used to retrieve the backface culling mode.
zh_cn: 此函数可用于检索背面剔除模式。

source: This function can be used to retrieve the bit mask value for all tile maps, returning the current mask value or -1 if there is an error or 0 if no mask is specified.
zh_cn: 此函数可用于检索所有tile maps的位掩码值，如果有错误，则返回当前掩码值或-1，如果未指定掩码，则返回0。

source: This function can be used to retrieve the bit mask value for the given tile map.
zh_cn: 此函数可用于检索给定tile map的位掩码值。

source: This function can be used to retrieve the border value for object/instance following of the given camera along the x axis (horizontal border).
zh_cn: 此函数可用于检索给定相机沿x轴(水平边界)的对象/实例跟随的边界值。

source: This function can be used to retrieve the border value for object/instance following of the given camera along the y axis (vertical border).
zh_cn: 此函数可用于检索给定相机沿y轴(垂直边界)跟随的对象/实例的边界值。

source: This function can be used to retrieve the current blend mode being used for drawing.
zh_cn: 此函数可用于检索当前用于绘图的混合模式。

source: This function can be used to retrieve the current colour write-enable values.
zh_cn: 此函数可用于检索当前的彩色写入启用值。

source: This function can be used to retrieve the current destination extended blend mode alpha factor.
zh_cn: 此函数可用于检索当前目标扩展混合模式alpha乘数。

source: This function can be used to retrieve the current destination extended blend mode factor being used for drawing.
zh_cn: 此函数可用于检索用于绘图的当前目标扩展混合模式乘数。

source: This function can be used to retrieve the current extended blend mode being used for drawing, separating out the blend modes into two parts - the RGB component and the Alpha component.
zh_cn: 此函数可用于检索当前用于绘图的扩展混合模式，将混合模式分为两部分RGB分量和Alpha分量。

source: This function can be used to retrieve the current extended blend mode being used for drawing.
zh_cn: 此函数可用于检索当前用于绘图的扩展混合模式。

source: This function can be used to retrieve the current source extended blend mode alpha factor.
zh_cn: 此函数可用于检索当前源扩展混合模式alpha乘数。

source: This function can be used to retrieve the current source extended blend mode factor being used for drawing.
zh_cn: 此函数可用于检索用于绘图的当前源扩展混合模式乘数。

source: This function can be used to retrieve the fog settings.
zh_cn: 此函数可用于检索雾设置。

source: This function can be used to retrieve the follow target of the given camera.
zh_cn: 此函数可用于检索给定相机的跟踪目标。

source: This function can be used to retrieve the given option value.
zh_cn: 此函数可用于检索给定的选项值。

source: This function can be used to retrieve the height (in pixels) of the given camera.
zh_cn: 此函数可用于检索给定相机的高度(以像素为单位)。

source: This function can be used to retrieve the height of the given view port.
zh_cn: 此函数可用于检索给定视口的高度。

source: This function can be used to retrieve the mapping string for the gamepad.
zh_cn: 此函数可用于检索手柄的映射字符串。

source: This function can be used to retrieve the movement speed of the given camera along the x axis (horizontal movement).
zh_cn: 此函数可用于检索给定相机沿x轴的移动速度(水平移动)。

source: This function can be used to retrieve the movement speed of the given camera along the y axis (vertical movement).
zh_cn: 此函数可用于检索给定相机沿y轴的移动速度(垂直移动)。

source: This function can be used to retrieve the number of frames that any given skeleton animation has.
zh_cn: 此函数可以用来检索任何给定的骨架动画的帧数。

source: This function can be used to retrieve the projection matrix.
zh_cn: 此函数可用于检索投影矩阵。

source: This function can be used to retrieve the sprite animation type as defined for the sprite resource in the Sprite Editor.
zh_cn: 此函数可用于检索sprite编辑器中为sprite资源定义的Sprite动画类型。

source: This function can be used to retrieve the sprite speed as defined for the sprite resource in the Sprite Editor.
zh_cn: 此函数可用于检索sprite编辑器中为sprite资源定义的Sprite速度。

source: This function can be used to retrieve the texture page IDs of the individual pages that make up a texture group.
zh_cn: 此函数可以用来检索组成纹理组的各个页面的纹理页面id。

source: This function can be used to retrieve the timing method to be used for rendering your game.
zh_cn: 此函数可用于检索渲染游戏时使用的计时方法。

source: This function can be used to retrieve the unique ID value for the surface assigned to the given view port (will return -1 if no surface has been assigned).
zh_cn: 此函数可用于检索分配给给定视口的表面的唯一ID值(如果没有分配表面，将返回-1)。

source: This function can be used to retrieve the unique ID value of a sprite element on a layer.
zh_cn: 此函数可以用来检索一个层上精灵元素的唯一ID值。

source: This function can be used to retrieve the unique ID value of the background element on a layer.
zh_cn: 此函数可以用来检索一个图层上背景元素的唯一ID值。

source: This function can be used to retrieve the unique ID value of the tile map element on a layer.
zh_cn: 此函数可以用来检索一个层上的tile map元素的唯一ID值。

source: This function can be used to retrieve the unique camera ID value for the camera assigned to the given view port (from 0 - 7).
zh_cn: 此函数可用于检索分配给给定视口的相机的唯一相机ID值(从0 - 7)。

source: This function can be used to retrieve the unique camera ID value of the currently active camera.
zh_cn: 此函数可用于检索当前活动相机的唯一相机ID值。

source: This function can be used to retrieve the unique camera ID value of the default camera (the camera that GameMaker uses when no camera views or ports are active in a game room).
zh_cn: 此函数可用于检索默认相机的唯一相机ID值(GameMaker在游戏房间中没有活动相机视图或端口时使用的相机)。

source: This function can be used to retrieve the unique layer ID value for the given particle system.
zh_cn: 此函数可用于检索给定粒子系统的惟一层ID值。

source: This function can be used to retrieve the view matrix.
zh_cn: 此函数可用于检索视图矩阵。

source: This function can be used to retrieve the width (in pixels) of the given camera.
zh_cn: 此函数可以用来检索给定相机的宽度(以像素为单位)。

source: This function can be used to retrieve the width of the given view port.
zh_cn: 此函数可用于检索给定视图端口的宽度。

source: This function can be used to retrieve the x position of the given view port.
zh_cn: 此函数可用于检索给定视图端口的x位置。

source: This function can be used to retrieve the x position of the view for a given camera.
zh_cn: 此函数可用于检索给定相机视图的x位置。

source: This function can be used to retrieve the y position of the given view port.
zh_cn: 此函数可用于检索给定视图端口的y位置。

source: This function can be used to retrieve the y position of the view for a given camera.
zh_cn: 此函数可用于检索给定相机视图的y位置。

source: This function can be used to retrieve the z comparison mode.
zh_cn: 此函数可用于检索z比较模式。

source: This function can be used to retrieve whether z-testing is enabled (the function returns true) or not (the function returns false).
zh_cn: 此函数可用于检索是否启用了z-testing(函数返回true)或未启用(函数返回false)。

source: This function can be used to retrieve whether z-writing is enabled (the function returns true) or not (the function returns false).
zh_cn: 此函数可用于检索是否启用了z-write(函数返回true)或未启用(函数返回false)。

source: This function can be used to return the name of the specified room as a string.
zh_cn: 此函数可用于以字符串形式返回指定房间的名称。

source: This function can be used to return the number of points on a path.
zh_cn: 此函数可以用来返回路径上的点数。

source: This function can be used to return whether the path is flagged as closed (true) or open (false), ie whether the path loops or if it has a definitive beginning and end.
zh_cn: 此函数可用于返回路径是否被标记为封闭(true)或开放(false)，即路径是否循环或是否有明确的起点和终点。

source: This function can be used to save any sub-image of a sprite to disc, giving it the specified filename.
zh_cn: 此函数可以用来保存一个精灵的任何子图像到磁盘，给它指定的文件名。

source: This function can be used to set a cell within the tile map element on the layer to a new tile using the actual position of the tile to change within the room.
zh_cn: 此函数可用于将层上tile map元素中的单元格设置为一个新的tile，使用tile在房间内的实际位置进行更改。
